
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Запись.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал") Тогда
		Элементы.ПроцентОтРабот.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	
	Если Запись.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал") Тогда
		Элементы.ПроцентОтРабот.Доступность = Ложь;
		Запись.ПроцентОтРабот = "";
	Иначе
		Элементы.ПроцентОтРабот.Доступность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
