
#Область ПрограммныйИнтерфейс

// Выводит элементы добавленных реквизитов с префиксом ВКМ_ на форму.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить элементы реквизитов.
//
Процедура ДополнениеФормы(Форма)Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		
		Если Форма.Элементы.Найти("ГруппаПериод") = Неопределено Тогда
			ДобавитьГруппуНаФорму(Форма,"ГруппаПериод");
		КонецЕсли; 
		
		Если Форма.Элементы.Найти("ДатаНачалаДействия") = Неопределено Тогда
			ДобавитьРеквизитДатаНачалаНаФорму(Форма);
		КонецЕсли;
		
		Если Форма.Элементы.Найти("ДатаОкончанияДействия") = Неопределено Тогда	
			ДобавитьРеквизитДатаОкончанияНаФорму(Форма);
		КонецЕсли;
		
		Если Форма.Элементы.Найти("ГруппаРасчет") = Неопределено Тогда
			ДобавитьГруппуНаФорму(Форма,"ГруппаРасчет");	
		КонецЕсли;
		
		Если Форма.Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда
			ДобавитьРеквизитСуммаАбонентскойПлатыНаФорму(Форма);
		КонецЕсли;
		
		Если Форма.Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
			ДобавитьРеквизитСтоимостьЧасаРаботыНаФорму(Форма);
		КонецЕсли;
			
	КонецЕсли; 
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКомандуЗаполнить(Форма);
	КонецЕсли; 
	 
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьГруппуНаФорму(Форма, ИмяГруппы);
	
	Группа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
КонецПроцедуры

Процедура ДобавитьРеквизитДатаНачалаНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("ДатаНачалаДействия",Тип("ПолеФормы"),Форма.Элементы.ГруппаПериод);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Дата начала действия";
	
КонецПроцедуры

Процедура ДобавитьРеквизитДатаОкончанияНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("ДатаОкончанияДействия",Тип("ПолеФормы"),Форма.Элементы.ГруппаПериод);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Дата окончания действия";
	
КонецПроцедуры 

Процедура ДобавитьРеквизитСуммаАбонентскойПлатыНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),Форма.Элементы.ГруппаРасчет);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Сумма абонентской платы";
	
КонецПроцедуры 

Процедура ДобавитьРеквизитСтоимостьЧасаРаботыНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),Форма.Элементы.ГруппаРасчет);
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Стоимость часа работы";
	
КонецПроцедуры  

Процедура ДобавитьКомандуЗаполнить(Форма);
	
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Заголовок = "Заполнить";
	КомандаЗаполнить.Отображение = ОтображениеКнопки.Текст;
	КомандаЗаполнить.Действие = "Заполнить";
	
	КнопкаКоманды = Форма.Элементы.Добавить("КнопкаЗаполнить",Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	КнопкаКоманды.ИмяКоманды = "Заполнить";
	КнопкаКоманды.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
КонецПроцедуры 

 #КонецОбласти
