
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура  СоздатьРеализацииПоДоговорам(Дата, СписокДоговоров) Экспорт
		 
	РеквизитыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокДоговоров, "Организация, Владелец");
	
	Для Каждого Договор ИЗ РеквизитыДоговоров Цикл
	
		Организация = Договор.Значение.Организация;
		Контрагент =  Договор.Значение.Владелец;
		
		НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НоваяРеализация.Заполнить(Неопределено);
		НоваяРеализация.Дата = КонецМесяца(Дата);
		НоваяРеализация.Организация = Организация;
		НоваяРеализация.Контрагент = Контрагент;
		НоваяРеализация.Договор = Договор.Ключ;
		НоваяРеализация.ВыполнитьАвтозаполнение();
	
		Если НоваяРеализация.ПроверитьЗаполнение() Тогда
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По договору %1 не создана реализация, так как не все заполнены обязательные поля", Договор.Ключ)); 
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли	