 
 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	 
#Область ОбработчикиСобытий
	 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка ИЗ СписокСотрудников Цикл
	
	//Запрос = Новый Запрос; 
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
	//|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Категория КАК Категория,
	//|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК СуммаПремии
	//|ИЗ
	//|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	//|ГДЕ
	//|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//
	//Выборка = Запрос.Выполнить().Выбрать(); 
	
	//Пока Выборка.Следующий() Цикл
		
		//Регистр расчета ВКМ_ДополнительныеНачисления
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия; 
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Категория = Строка.Категория;
		Движение.Результат = Строка.СуммаПремии;
		
		//Регистр расчета ВКМ_Удержания
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Результат = Строка.СуммаПремии * 13 / 100;
		Движение.Размер = Строка.СуммаПремии; 
		НДФЛ = Движение.Результат;
		
		//Регистр накопления ВКМ_ВзаиморасчетыССотрудниками Приход
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.СуммаПремии - НДФЛ;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
		 
 КонецПроцедуры
	 
#КонецОбласти
	 
 #КонецЕсли
 
 
