
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Диаграмма.Очистить();
	ДанныеОбОтпусках = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	
	Для Каждого Строка ИЗ ДанныеОбОтпусках Цикл
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник; 
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
