 
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
  
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ДниВОтпуске Приход
	Движения.ВКМ_ДниВОтпуске.Записывать = Истина;
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ДниВОтпуске.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДнейВОтпуске = Окр((КонецДня(Строка.ДатаОкончания) - Строка.ДатаНачала) / 86400);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
