
#Область СлужебныеПроцедурыИФункции

Функция ДанныеСотрудника(Сотрудник, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория КАК Категория,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Категория", Выборка.Категория);
	ДанныеСотрудника.Вставить("ПроцентОтРабот", Выборка.ПроцентОтРабот);
	
	Возврат ДанныеСотрудника;
	
КонецФункции

#КонецОбласти
