
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Начало.Квитко 08.09.25
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ВКМ_РаботаСФормойСервер.ДополнениеФормы(ЭтотОбъект);
	КонецЕсли;
	// -- Конец.Квитко 08.09.25
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	// ++ Начало.Квитко 08.09.25
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		ВКМ_РаботаСФормойСервер.ДополнениеФормы(ЭтотОбъект);
	Иначе
		
		Если Элементы.Найти("ГруппаПериод") <> Неопределено Тогда
			Элементы.Удалить(Элементы.ГруппаПериод);
			Объект.ВКМ_ДатаНачалаДействия = Дата(1, 1, 1);
			Объект.ВКМ_ДатаОкончанияДействия = Дата(1, 1, 1);
		КонецЕсли;
				
		Если Элементы.Найти("ГруппаРасчет") <> Неопределено Тогда
			Элементы.Удалить(Элементы.ГруппаРасчет);
			Объект.ВКМ_СуммаАбонентскойПлаты = 0;
			Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		КонецЕсли;
				
	КонецЕсли;
	// -- Конец.Квитко 08.09.25	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Начало.Квитко 08.09.25
	ВидДоговораПриИзмененииНаСервере(); 
	// -- Конец.Квитко 08.09.25	
	
КонецПроцедуры

#КонецОбласти