
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Начало.Квитко 20.10.25
	ВКМ_РаботаСФормойСервер.ДополнениеФормы(ЭтотОбъект);
	
	Элементы.ГруппаПериод.Видимость = ?(Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание, Истина, Ложь);
	Элементы.ГруппаРасчет.Видимость = ?(Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание, Истина, Ложь);
	// -- Конец.Квитко 20.10.25
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Начало.Квитко 08.09.25
	ВидДоговораПриИзмененииНаСервере(); 
	// -- Конец.Квитко 08.09.25	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	// ++ Начало.Квитко 20.10.25
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		Элементы.ГруппаПериод.Видимость = Истина;
		Элементы.ГруппаРасчет.Видимость = Истина;
	Иначе
		Элементы.ГруппаПериод.Видимость = Ложь;
		Элементы.ГруппаРасчет.Видимость = Ложь;
		Объект.ВКМ_ДатаНачалаДействия = Дата(1, 1, 1);
		Объект.ВКМ_ДатаОкончанияДействия = Дата(1, 1, 1);
		Объект.ВКМ_СуммаАбонентскойПлаты = 0;
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;			
	КонецЕсли;
	// -- Конец.Квитко 20.10.25	
	
КонецПроцедуры

#КонецОбласти