
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// ++ Начало.Квитко 09.09.25
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаНачалаДействия) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Дата начала действия' обязательно для заполнения", ЭтотОбъект, "ВКМ_ДатаНачалаДействия");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаОкончанияДействия) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Дата окончания действия' обязательно для заполнения", ЭтотОбъект, "ВКМ_ДатаОкончанияДействия");
			Отказ = Истина;
		КонецЕсли;                                                                                                                          
		
		Если НЕ ЗначениеЗаполнено(ВКМ_СуммаАбонентскойПлаты) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Сумма абонентской платы' обязательно для заполнения", ЭтотОбъект, "ВКМ_СуммаАбонентскойПлаты");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_СтоимостьЧасаРаботы) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле 'Стоимость часа работы' обязательно для заполнения", ЭтотОбъект, "ВКМ_СтоимостьЧасаРаботы");
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли;
	// -- Конец.Квитко 09.09.25	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли

