
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания) Экспорт 
	
	НаборЗаписей = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Курсор = ДатаНачала;
	
	Пока Курсор <= ДатаОкончания Цикл 
		
		Запись = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьМенеджерЗаписи();
		Запись.Дата = Курсор;
		
		Если ДеньНедели(Курсор) <=5 Тогда
			Запись.Значение = 1;
		Иначе 
			Запись.Значение = 0;
		КонецЕсли;
		
		Запись.Записать();
		Курсор = Курсор + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли